src/InformationRegisters/кфкИсходящиеСообщения/кфкИсходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9bb60e0f-842a-4fa4-ac2b-edd89101fe4a">
  <name>кфкИсходящиеСообщения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="6b53242f-90ec-4441-929d-e40a10912da1">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="645be078-31fe-4466-b372-8bb9bfa3f5be">
    <name>ИсходныеДанные</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c8b56203-f691-4ecb-baa5-349014dc183d">
    <name>ЭтоУдаление</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="219a3ae5-d22d-467d-b06a-ac34b1cb0b28">
    <name>КлючСообщения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="afab001f-7c73-48bc-8796-c31e7bf52af0">
    <name>Заголовки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="bb437059-733a-4568-833f-93a08c527b14">
    <name>ТелоСообщения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="edf8a9c9-f606-41ee-a73e-b96b0e7cca2a">
    <name>Продюсер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="999a4a8e-9e06-4003-bef9-df9a1040dd3c">
    <name>ТипОбъект</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="292b6eec-1780-46e7-8559-9493aa1ddb42">
    <name>ТипИсходныхДанных</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>120</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c7c42290-9fd9-47f2-aab1-06ebdfba17ce">
    <name>КлючОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="46012b4d-4b78-4cbd-8d0d-18101a391f7f">
    <name>СобытиеРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95dd5ec5-8b2e-459f-a936-2a5d2be7b2a4">
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="28f1a3aa-a8a0-404d-97be-3f9ebb177a1a">
    <name>ДатаОбработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ee05bfa3-5c0b-4ad6-962d-b2ec05fed003">
    <name>ДатаВыгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e799e980-8ada-4039-a30c-da9f60bebb2d">
    <name>ДлОбработкиМС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a856e5db-41c4-4e7d-981e-2c56dcb0b477">
    <name>ТекстЖурнала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6d139c82-f66c-4620-a76a-8cb29ad47bce">
    <name>КоличествоОбработок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="285c25ea-c7ab-4ec5-b049-028ac1a7e72d">
    <name>КоличествоВыгрузок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="aa816974-7fec-4c4a-a209-74cbe7e41026">
    <name>МеткаИзмененияМС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="bc51b526-bde0-4420-be0b-4163f25aa1ed">
    <name>КлючЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="dcea6dff-ee4d-4454-ab67-2dff64dc7131">
    <name>ДатаРегистрацииМС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/кфкСтатусыСообщений/кфкСтатусыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="90c87861-83c3-4174-81dd-550f291515d7">
  <name>кфкСтатусыСообщений</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="e87ed46a-b4fe-41ad-a05b-c7d43a993d59">
    <name>Новое</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4aa47c21-1293-47d6-b3ab-9d29a043b1dc">
    <name>Обработано</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="82907498-6643-4090-a81d-dd1982638a68">
    <name>ОбработкаОтменена</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bb65cb4f-750e-4084-b787-633ed9393166">
    <name>ОшибкаОбработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="31aa5e8e-008e-4e64-bdea-a9307ad0bcc1">
    <name>Выгружено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2aad9bb4-aca4-411a-8268-a2c8d7a9efe8">
    <name>ОшибкаВыгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b1566b75-70c6-497a-8ff6-bdaa91eddbbe">
    <name>ВыгрузкаОтменена</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/CommonModules/ОМ_кфкФоновыеОперацииСлужебный_Отправка/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Регистрирует компонентные контракты исходящих сообщений.
Процедура ИсполняемыеСценарии() Экспорт

	ЮТТесты
		.ВТранзакции()
		.После("ПослеКаждогоТеста")
		.ДобавитьТестовыйНабор("ОбщийМодуль кфкФоновыеОперацииСлужебный. Исходящие сообщения")
			.Тег("Модульные")
			.Тег("кфкФоновыеОперацииСлужебный")
			.Тег("Отправка")
			.Тег("Критичные")
			.ДобавитьСерверныйТест("ВыборкаИсходящих_ОтбираетДопустимыеЗаписи")
				.Тег("ОтбираетДопустимыеЗаписи")
				.СПараметрами(Истина)
				.СПараметрами(Ложь)
			.ДобавитьСерверныйТест("ВыборкаОтправки_СоблюдаетПорядокИЛимит")
				.Тег("СоблюдаетПорядокИЛимит")
				.СПараметрами(1)
				.СПараметрами(2)
			.ДобавитьСерверныйТест("ВыборкаСериализацииВПотоке_УчитываетПолныйКлюч")
				.Тег("УчитываетПолныйКлюч")
			.ДобавитьСерверныйТест("ВыборкаОтправкиВПотоке_УчитываетПолныйКлюч")
				.Тег("УчитываетПолныйКлюч")
			.ДобавитьСерверныйТест("Сериализация_СохраняетСогласованныйИсход")
				.Тег("СохраняетСогласованныйИсход")
				.СПараметрами("Успех", Перечисления.кфкСтатусыСообщений.Обработано)
				.СПараметрами("Отказ", Перечисления.кфкСтатусыСообщений.ОбработкаОтменена)
				.СПараметрами("Исключение", Перечисления.кфкСтатусыСообщений.ОшибкаОбработки)
				.СПараметрами("НетТела", Перечисления.кфкСтатусыСообщений.ОшибкаОбработки)
				.СПараметрами("НетПравила", Перечисления.кфкСтатусыСообщений.ОшибкаОбработки)
				.СПараметрами("НетМетода", Перечисления.кфкСтатусыСообщений.ОшибкаОбработки)
			.ДобавитьСерверныйТест("Сериализация_НеПереноситДанныеМеждуСообщениями")
				.Тег("НеПереноситДанныеМеждуСообщениями")
			.ДобавитьСерверныйТест("СериализацияКД_ИзолируетСообщенияИУчитываетФлаги")
				.Тег("ИзолируетСообщенияИУчитываетФлаги")
				.СПараметрами(Истина, Перечисления.кфкСтатусыСообщений.ОбработкаОтменена)
				.СПараметрами(Ложь, Перечисления.кфкСтатусыСообщений.ОшибкаОбработки)
			.ДобавитьСерверныйТест("СериализацияКД_ПрерываетРегистрПриОшибке")
				.Тег("ПрерываетРегистрПриОшибке")
			.ДобавитьСерверныйТест("Отправка_СопоставляетОшибкуПослеПропуска")
				.Тег("СопоставляетОшибкуПослеПропуска")
			.ДобавитьСерверныйТест("Отправка_РазрешаетПовторПослеОшибки")
				.Тег("РазрешаетПовторПослеОшибки")
			.ДобавитьСерверныйТест("Отправка_ЧастичнаяОшибкаНеПодтверждаетХэш")
				.Тег("ЧастичнаяОшибкаНеПодтверждаетХэш")
			.ДобавитьСерверныйТест("Отправка_ПодавляетУспешныйДубль")
				.Тег("ПодавляетУспешныйДубль")
				.СПараметрами(Истина)
				.СПараметрами(Ложь)
			.ДобавитьСерверныйТест("Отправка_ИсключениеНеПодтверждаетСообщение")
				.Тег("ИсключениеНеПодтверждаетСообщение")
			.ДобавитьСерверныйТест("Отправка_ОшибкаСохраненияНеПодтверждаетЗавершение")
				.ВТранзакции(Ложь)
				.Тег("ОшибкаСохраненияНеПодтверждаетЗавершение")
			.ДобавитьСерверныйТест("ПакетKafka_СохраняетАдресациюИТело")
				.Тег("СохраняетАдресациюИТело")
				.СПараметрами("", "объект")
				.СПараметрами("заданный", "заданный")
			.ДобавитьСерверныйТест("ПакетKafka_ОтклоняетОтсутствующийТопик")
				.Тег("ОтклоняетОтсутствующийТопик");

КонецПроцедуры

// Освобождает внешнюю границу и контролируемый отказ независимо от результата теста.
Процедура ПослеКаждогоТеста() Экспорт

	Контекст = ЮТест.КонтекстТеста();
	Контекст.Удалить("ют_ОшибкаЗаписиИсходящих");
	Контекст.Удалить("ют_ВызовыКД");
	Контекст.Удалить("ют_ПропуститьКД");
	Контекст.Удалить("ют_КомпонентаKafka");
	Контекст.Удалить("ют_ВызовыФабрикиKafka");
	Мокито.Сбросить();

	Ключ = Неопределено; // Строка, Неопределено
	Если Не Контекст.Свойство("ют_КлючОчисткиПослеСбоя", Ключ) Тогда
		Возврат;
	КонецЕсли;

	Исходящие = РегистрыСведений.кфкИсходящиеСообщения.СоздатьНаборЗаписей();
	Исходящие.Отбор.КлючЗаписи.Установить(Ключ);
	Исходящие.Записать();
	Назначения = РегистрыСведений.кфкОчередьПотоков.СоздатьНаборЗаписей();
	Назначения.Отбор.Ключ.Установить(Ключ);
	Назначения.Записать();
	Хэши = РегистрыСведений.кфкХэшСуммыСообщений.СоздатьНаборЗаписей();
	Хэши.Отбор.КлючЗаписи.Установить(Ключ);
	Хэши.Записать();
	Контекст.Удалить("ют_КлючОчисткиПослеСбоя");

КонецПроцедуры

#Область ВыборкиИсходящих

// Проверяет независимые ограничения общей выборки.
// Параметры:
//  Сериализация - Булево
Процедура ВыборкаИсходящих_ОтбираетДопустимыеЗаписи(Сериализация) Экспорт

	Продюсер = НовыйПродюсер();
	Статус = ?(Сериализация, Перечисления.кфкСтатусыСообщений.Новое,
		Перечисления.кфкСтатусыСообщений.Обработано);
	ДоГраницы = НовоеСообщение(Продюсер, Статус, 999);
	НаГранице = НовоеСообщение(Продюсер, Статус, 1000);
	ПослеГраницы = НовоеСообщение(Продюсер, Статус, 1001);
	Чужое = НовоеСообщение(НовыйПродюсер(), Статус, 1000);
	ДругойСтатус = НовоеСообщение(Продюсер, Перечисления.кфкСтатусыСообщений.Выгружено, 1000);
	Старая = НовоеСообщение(Продюсер, Статус, 1002);
	Новая = НовоеСообщение(Продюсер, Статус, 1003, Старая.КлючЗаписи);
	Занятая = НовоеСообщение(Продюсер, Статус, 1004);
	НазначитьСообщение(Занятая, Новый УникальныйИдентификатор, 777);
	Продюсеры = ЮТМетоды.МассивПараметров(Продюсер);

	Если Сериализация Тогда
		Выборка = кфкФоновыеОперацииСлужебный.ют_ВыборкаСериализации(Продюсеры, 100, 1000);
	Иначе
		Выборка = кфкФоновыеОперацииСлужебный.ют_ВыборкаОтправки(Продюсеры, 100, 1000);
	КонецЕсли;

	Ожидаемые = ЮТМетоды.МассивПараметров(НаГранице.КлючЗаписи, ПослеГраницы.КлючЗаписи, Новая.КлючЗаписи);
	ЮТест.ОжидаетЧто(КлючиВыборки(Выборка)).Равно(Ожидаемые);
	ПроверитьИсходящее(ДоГраницы, Статус, 3);
	ПроверитьИсходящее(Чужое, Статус, 3);
	ПроверитьИсходящее(ДругойСтатус, Перечисления.кфкСтатусыСообщений.Выгружено, 3);
	ПроверитьИсходящее(Занятая, Статус, 3);

КонецПроцедуры

// Проверяет точный лимит и порядок исходных SQL-результатов.
// Параметры:
//  Лимит - Число
Процедура ВыборкаОтправки_СоблюдаетПорядокИЛимит(Лимит) Экспорт

	Продюсер = НовыйПродюсер();
	Поздняя = НовоеСообщение(Продюсер, Перечисления.кфкСтатусыСообщений.Обработано, 2000);
	Ранняя = НовоеСообщение(Продюсер, Перечисления.кфкСтатусыСообщений.Обработано, 1000);
	Продюсеры = ЮТМетоды.МассивПараметров(Продюсер);

	Выборка = кфкФоновыеОперацииСлужебный.ют_ВыборкаОтправки(Продюсеры, Лимит, 1000);

	Ожидаемые = ЮТМетоды.МассивПараметров(Ранняя.КлючЗаписи);
	Если Лимит = 2 Тогда
		Ожидаемые.Добавить(Поздняя.КлючЗаписи);
	КонецЕсли;
	ЮТест.ОжидаетЧто(КлючиВыборки(Выборка)).Равно(Ожидаемые);

КонецПроцедуры

// Проверяет связь назначения с UUID и датой исходной регистрации.
Процедура ВыборкаСериализацииВПотоке_УчитываетПолныйКлюч() Экспорт

	Продюсер = НовыйПродюсер();
	Поток = Новый УникальныйИдентификатор;
	Своя = НовоеСообщение(Продюсер, Перечисления.кфкСтатусыСообщений.Новое, 1000);
	Чужая = НовоеСообщение(Продюсер, Перечисления.кфкСтатусыСообщений.Новое, 1001);
	Старая = НовоеСообщение(Продюсер, Перечисления.кфкСтатусыСообщений.Новое, 1002);
	НазначитьСообщение(Своя, Поток);
	НазначитьСообщение(Чужая, Новый УникальныйИдентификатор);
	НазначитьСообщение(Старая, Поток, 999);

	Выборка = кфкФоновыеОперацииСлужебный.ют_ВыборкаСериализацииВПотоке(Поток, 100);

	ЮТест.ОжидаетЧто(КлючиВыборки(Выборка)).Равно(ЮТМетоды.МассивПараметров(Своя.КлючЗаписи));
	ПроверитьНазначение(Своя, Поток, Истина);

КонецПроцедуры
// Проверяет связь назначения с UUID и датой исходной регистрации.
Процедура ВыборкаОтправкиВПотоке_УчитываетПолныйКлюч() Экспорт

	Продюсер = НовыйПродюсер();
	Поток = Новый УникальныйИдентификатор;
	Своя = НовоеСообщение(Продюсер, Перечисления.кфкСтатусыСообщений.Обработано, 1000);
	Чужая = НовоеСообщение(Продюсер, Перечисления.кфкСтатусыСообщений.Обработано, 1001);
	Старая = НовоеСообщение(Продюсер, Перечисления.кфкСтатусыСообщений.Обработано, 1002);
	НазначитьСообщение(Своя, Поток);
	НазначитьСообщение(Чужая, Новый УникальныйИдентификатор);
	НазначитьСообщение(Старая, Поток, 999);

	Группы = кфкФоновыеОперацииСлужебный.ют_ВыборкаОтправкиВПотоке(Поток, 100);
	ЮТест.ОжидаетЧто(Группы.Следующий()).Равно(Истина);
	Типы = Группы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЮТест.ОжидаетЧто(Типы.Следующий()).Равно(Истина);
	Выборка = Типы.Выбрать();

	ЮТест.ОжидаетЧто(КлючиВыборки(Выборка)).Равно(ЮТМетоды.МассивПараметров(Своя.КлючЗаписи));
	ПроверитьНазначение(Своя, Поток, Истина);

КонецПроцедуры

#КонецОбласти

#Область Сериализация

// Проверяет согласованный результат обработки и освобождение собственного назначения.
// Параметры:
//  Исход - Строка
//  Статус - ПеречислениеСсылка.кфкСтатусыСообщений
Процедура Сериализация_СохраняетСогласованныйИсход(Исход, Статус) Экспорт

	Продюсер = НовыйПродюсер();
	Поток = Новый УникальныйИдентификатор;
	Запись = НовоеСообщение(Продюсер, Перечисления.кфкСтатусыСообщений.Новое, 1000);
	Запись.ИсходныеДанные = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(ДанныеСериализации(Исход, "ключ-1"));
	Запись.Записать();
	НазначитьСообщение(Запись, Поток);
	Чужая = НовоеСообщение(Продюсер, Перечисления.кфкСтатусыСообщений.Новое, 1001);
	Выборка = кфкФоновыеОперацииСлужебный.ют_ВыборкаСериализацииВПотоке(Поток, 100);

	кфкФоновыеОперацииСлужебный.ют_СериализоватьПакет(
		Выборка, кфкФоновыеОперацииСлужебный.ют_ОчередиИсходящих(),
		Поток, ПравилаСериализации(Продюсер, Исход));

	ПроверитьИсходящее(Запись, Статус, 3);
	ПроверитьНазначение(Запись, Поток, Ложь);
	ПроверитьИсходящее(Чужая, Перечисления.кфкСтатусыСообщений.Новое, 3);
	Условие = ЮТест.Предикат()
		.Реквизит("КлючЗаписи").Равно(Запись.КлючЗаписи)
		.Реквизит("КоличествоОбработок").Равно(3);
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкИсходящиеСообщения").СодержитЗаписи(Условие);
	Запись.Прочитать();
	ЮТест.ОжидаетЧто(СтрНайти(Запись.ТекстЖурнала, "исходный журнал") > 0).Равно(Истина);
	Если Исход = "Успех" Тогда
		ЮТест.ОжидаетЧто(Запись.КлючСообщения).Равно("ключ-1");
		ЮТест.ОжидаетЧто(кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(Запись.ТелоСообщения)).Равно("тело ключ-1");
		Заголовки = кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(Запись.Заголовки); // Соответствие Из КлючИЗначение
		ЮТест.ОжидаетЧто(Заголовки.Получить("Источник")).Равно("ключ-1");
	Иначе
		ЮТест.ОжидаетЧто(кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(Запись.ТелоСообщения))
			.Равно(Неопределено);
	КонецЕсли;

КонецПроцедуры

// Проверяет передачу данных между двумя вызовами прикладного сериализатора.
Процедура Сериализация_НеПереноситДанныеМеждуСообщениями() Экспорт

	Продюсер = НовыйПродюсер();
	Поток = Новый УникальныйИдентификатор;
	Первая = НовоеСообщение(Продюсер, Перечисления.кфкСтатусыСообщений.Новое, 1000);
	Вторая = НовоеСообщение(Продюсер, Перечисления.кфкСтатусыСообщений.Новое, 1001);
	Первая.ИсходныеДанные = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(ДанныеСериализации("Успех", "первый"));
	Вторая.ИсходныеДанные = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(ДанныеСериализации("Успех", "второй"));
	Первая.Записать();
	Вторая.Записать();
	НазначитьСообщение(Первая, Поток);
	НазначитьСообщение(Вторая, Поток);
	Выборка = кфкФоновыеОперацииСлужебный.ют_ВыборкаСериализацииВПотоке(Поток, 100);

	кфкФоновыеОперацииСлужебный.ют_СериализоватьПакет(
		Выборка, кфкФоновыеОперацииСлужебный.ют_ОчередиИсходящих(),
		Поток, ПравилаСериализации(Продюсер, "Успех"));

	Первая.Прочитать();
	Вторая.Прочитать();
	ЮТест.ОжидаетЧто(Первая.КлючСообщения).Равно("первый");
	ЮТест.ОжидаетЧто(Вторая.КлючСообщения).Равно("второй");
	ЮТест.ОжидаетЧто(кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(Первая.ТелоСообщения)).Равно("тело первый");
	ЮТест.ОжидаетЧто(кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(Вторая.ТелоСообщения)).Равно("тело второй");
	ЗаголовкиПервой =
		кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(Первая.Заголовки); // Соответствие Из КлючИЗначение
	ЮТест.ОжидаетЧто(ЗаголовкиПервой.Получить("Источник")).Равно("первый");
	ЗаголовкиВторой =
		кфкОбщегоНазначенияСлужебный.ЗначениеИзХранилища(Вторая.Заголовки); // Соответствие Из КлючИЗначение
	ЮТест.ОжидаетЧто(ЗаголовкиВторой.Получить("Источник")).Равно("второй");
	ПроверитьНазначение(Первая, Поток, Ложь);
	ПроверитьНазначение(Вторая, Поток, Ложь);

КонецПроцедуры

// Проверяет сброс состояния КД и передачу флагов при повторном использовании компонентов.
// Параметры:
//  Пропустить - Булево
//  Статус - ПеречислениеСсылка.кфкСтатусыСообщений
Процедура СериализацияКД_ИзолируетСообщенияИУчитываетФлаги(Пропустить, Статус) Экспорт

	Продюсер = НовыйПродюсер();
	Поток = Новый УникальныйИдентификатор;
	Первая = НовоеСообщение(Продюсер, Перечисления.кфкСтатусыСообщений.Новое, 1000);
	Вторая = НовоеСообщение(Продюсер, Перечисления.кфкСтатусыСообщений.Новое, 1001);
	Первая.ИсходныеДанные = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(ДанныеСериализации("КД", "первый"));
	Вторая.ИсходныеДанные = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(ДанныеСериализации("КД", "второй"));
	Первая.Записать();
	Вторая.Записать();
	НазначитьСообщение(Первая, Поток);
	НазначитьСообщение(Вторая, Поток);
	Компоненты = кфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена("Отправка");
	Компоненты.МенеджерОбмена = ОМ_кфкФоновыеОперацииСлужебный_Отправка;
	Компоненты.ЭтоМенеджерОбменКФК = Истина;
	Правило = Новый Структура;
	Правило.Вставить("Тип", Перечисления.кфкТипыОбработчиков.КонвертацияДанных);
	Правило.Вставить("КомпонентыОбмена", Компоненты);
	Правило.Вставить("ИмяПОД", "unit");
	Правила = Новый Соответствие;
	Правила.Вставить(НРег(XMLСтрока(Продюсер) + Первая.ТипОбъект), Правило);
	История = Новый Массив; // Массив Из Структура
	ЮТест.КонтекстТеста().Вставить("ют_ВызовыКД", История);
	ЮТест.КонтекстТеста().Вставить("ют_ПропуститьКД", Пропустить);
	Выборка = кфкФоновыеОперацииСлужебный.ют_ВыборкаСериализацииВПотоке(Поток, 100);

	кфкФоновыеОперацииСлужебный.ют_СериализоватьПакет(
		Выборка, кфкФоновыеОперацииСлужебный.ют_ОчередиИсходящих(), Поток, Правила);

	ПроверитьИсходящее(Первая, Статус, 3);
	ПроверитьИсходящее(Вторая, Статус, 3);
	ПроверитьНазначение(Первая, Поток, Ложь);
	ПроверитьНазначение(Вторая, Поток, Ложь);
	ЮТест.ОжидаетЧто(История).ИмеетДлину(2);
	ЮТест.ОжидаетЧто(История[0].КлючДанных).Равно("первый");
	ЮТест.ОжидаетЧто(История[1].КлючДанных).Равно("второй");
	ЮТест.ОжидаетЧто(История[0].КлючДоВызова).Равно("");
	ЮТест.ОжидаетЧто(История[1].КлючДоВызова).Равно("");
	ЮТест.ОжидаетЧто(История[0].ЗаголовковДоВызова).Равно(0);
	ЮТест.ОжидаетЧто(История[1].ЗаголовковДоВызова).Равно(0);
	ЮТест.ОжидаетЧто(История[1].ОшибкаДоВызова).Равно(Ложь);
	ЮТест.ОжидаетЧто(История[1].ПропускДоВызова).Равно(Ложь);

КонецПроцедуры
// Моделирует прикладное правило КД через штатный интерфейс менеджера обмена.
// Параметры:
//  КомпонентыОбмена - см. кфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
//  Источник - Структура - данные сообщения либо строка регистра.
Процедура ПередКонвертацией(КомпонентыОбмена, Источник) Экспорт

	Контекст = ЮТест.КонтекстТеста();
	История = Контекст["ют_ВызовыКД"]; // Массив Из Структура
	КлючДанных = "";
	Если Не Источник.Свойство("Ключ", КлючДанных) Тогда
		КлючДанных = Источник.Идентификатор;
	КонецЕсли;
	Вызов = Новый Структура;
	Вызов.Вставить("КлючДанных", КлючДанных);
	Вызов.Вставить("КлючДоВызова", КомпонентыОбмена.КлючСообщения);
	Вызов.Вставить("ЗаголовковДоВызова", КомпонентыОбмена.ЗаголовкиСообщения.Количество());
	Вызов.Вставить("ОшибкаДоВызова", КомпонентыОбмена.ФлагОшибки);
	Вызов.Вставить("ПропускДоВызова", КомпонентыОбмена.ФлагПропустить);
	История.Добавить(Вызов);
	КомпонентыОбмена.КлючСообщения = КлючДанных;
	КомпонентыОбмена.ЗаголовкиСообщения.Вставить("Источник", КлючДанных);
	Пропустить = Контекст["ют_ПропуститьКД"]; // Булево
	КомпонентыОбмена.ФлагПропустить = Пропустить;
	КомпонентыОбмена.ФлагОшибки = Не Пропустить;
	КомпонентыОбмена.ПротоколКонвертации.Добавить("unit: прикладной исход КД");

КонецПроцедуры
// Проверяет прекращение обхода регистра после первой ошибки прикладного правила КД.
Процедура СериализацияКД_ПрерываетРегистрПриОшибке() Экспорт

	Регистратор = ЮТест.Данные().КонструкторОбъекта(Документы.кфк_т_ТестовыйДокумент)
		.Установить("Дата", Дата(2026, 1, 1))
		.Записать(Ложь, Истина);
	Набор = РегистрыСведений.кфк_т_ТестовыйРегистрСведенийПР.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Установить(Регистратор);
	Для Индекс = 1 По 2 Цикл
		СтрокаРегистра = Набор.Добавить();
		СтрокаРегистра.Период = Дата(2026, 1, 1);
		СтрокаРегистра.Идентификатор = "строка " + Строка(Индекс);
		СтрокаРегистра.Значение = Индекс;
	КонецЦикла;
	Набор.ОбменДанными.Загрузка = Истина;
	Набор.Записать();
	Пакет = НовыйПакет();
	Запись = НовоеСообщение(Пакет.Продюсер, Перечисления.кфкСтатусыСообщений.Новое, 1000);
	Запись.ТипОбъект = "РегистрСведений.кфк_т_ТестовыйРегистрСведенийПР";
	Запись.ТипИсходныхДанных = "InformationRegisterRecordSet.кфк_т_ТестовыйРегистрСведенийПР";
	ИсходныеДанные = Новый Структура;
	ИсходныеДанные.Вставить("Регистратор", Регистратор);
	ИсходныеДанные.Вставить("ДополнительныеСвойства", Новый Структура);
	Запись.ИсходныеДанные = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(ИсходныеДанные);
	Запись.Записать();
	НазначитьСообщение(Запись, Пакет.Поток);
	Компоненты = кфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена("Отправка");
	Компоненты.МенеджерОбмена = ОМ_кфкФоновыеОперацииСлужебный_Отправка;
	Компоненты.ЭтоМенеджерОбменКФК = Истина;
	Правило = Новый Структура;
	Правило.Вставить("Тип", Перечисления.кфкТипыОбработчиков.КонвертацияДанных);
	Правило.Вставить("КомпонентыОбмена", Компоненты);
	Правило.Вставить("ИмяПОД", "unit");
	Правила = Новый Соответствие;
	Правила.Вставить(НРег(XMLСтрока(Пакет.Продюсер) + Запись.ТипОбъект), Правило);
	История = Новый Массив; // Массив Из Структура
	ЮТест.КонтекстТеста().Вставить("ют_ВызовыКД", История);
	ЮТест.КонтекстТеста().Вставить("ют_ПропуститьКД", Ложь);
	Выборка = кфкФоновыеОперацииСлужебный.ют_ВыборкаСериализацииВПотоке(Пакет.Поток, 100);

	кфкФоновыеОперацииСлужебный.ют_СериализоватьПакет(
		Выборка, кфкФоновыеОперацииСлужебный.ют_ОчередиИсходящих(), Пакет.Поток, Правила);

	ЮТест.ОжидаетЧто(История).ИмеетДлину(1);
	ПроверитьИсходящее(Запись, Перечисления.кфкСтатусыСообщений.ОшибкаОбработки, 3);
	ПроверитьНазначение(Запись, Пакет.Поток, Ложь);
	Условие = ЮТест.Предикат().Реквизит("Регистратор").Равно(Регистратор)
		.Реквизит("Идентификатор").Равно("строка 2");
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфк_т_ТестовыйРегистрСведенийПР").СодержитЗаписи(Условие);

КонецПроцедуры

#КонецОбласти

#Область Отправка

// Проверяет соответствие транспортного индекса исходному сообщению после пропущенного дубля.
Процедура Отправка_СопоставляетОшибкуПослеПропуска() Экспорт

	Пакет = НовыйПакет();
	Дубль = НовоеСообщение(Пакет.Продюсер, Перечисления.кфкСтатусыСообщений.Обработано, 1000);
	НазначитьСообщение(Дубль, Пакет.Поток);
	Пакет.Компонента.НастроитьОтвет("ОтправитьПакетСРезультатом", УспешныйОтвет());
	ОтправитьПакет(Пакет);
	ПроверитьИсходящее(Дубль, Перечисления.кфкСтатусыСообщений.Выгружено, 4);

	Успешная = НовоеСообщение(Пакет.Продюсер, Перечисления.кфкСтатусыСообщений.Обработано, 1001);
	Ошибочная = НовоеСообщение(Пакет.Продюсер, Перечисления.кфкСтатусыСообщений.Обработано, 1002);
	НазначитьСообщение(Дубль, Пакет.Поток);
	НазначитьСообщение(Успешная, Пакет.Поток);
	НазначитьСообщение(Ошибочная, Пакет.Поток);
	Пакет.Компонента.НастроитьОтвет("ОтправитьПакетСРезультатом", ЧастичныйОтвет());

	ОтправитьПакет(Пакет);

	ПроверитьИсходящее(Дубль, Перечисления.кфкСтатусыСообщений.ВыгрузкаОтменена, 5);
	ПроверитьИсходящее(Успешная, Перечисления.кфкСтатусыСообщений.Выгружено, 4);
	ПроверитьИсходящее(Ошибочная, Перечисления.кфкСтатусыСообщений.ОшибкаВыгрузки, 4);

КонецПроцедуры

// Проверяет доступность повторной отправки после отрицательного транспортного ответа.
Процедура Отправка_РазрешаетПовторПослеОшибки() Экспорт

	Пакет = НовыйПакет();
	Запись = НовоеСообщение(Пакет.Продюсер, Перечисления.кфкСтатусыСообщений.Обработано, 1000);
	НазначитьСообщение(Запись, Пакет.Поток);
	Пакет.Компонента.НастроитьОтвет("ОтправитьПакетСРезультатом", "");

	ОтправитьПакет(Пакет);

	ПроверитьИсходящее(Запись, Перечисления.кфкСтатусыСообщений.ОшибкаВыгрузки, 4);
	ПроверитьНазначение(Запись, Пакет.Поток, Ложь);
	ПроверитьХэш(Запись, Ложь);
	НазначитьСообщение(Запись, Пакет.Поток);
	Пакет.Компонента.НастроитьОтвет("ОтправитьПакетСРезультатом", УспешныйОтвет());

	ОтправитьПакет(Пакет);

	ПроверитьИсходящее(Запись, Перечисления.кфкСтатусыСообщений.Выгружено, 5);
	ПроверитьХэш(Запись, Истина);
	ЮТест.ОжидаетЧто(ВызовыОтправки(Пакет)).ИмеетДлину(2);

КонецПроцедуры

// Проверяет сохранение только подтвержденного хэша при частичной доставке.
Процедура Отправка_ЧастичнаяОшибкаНеПодтверждаетХэш() Экспорт

	Пакет = НовыйПакет();
	Успешная = НовоеСообщение(Пакет.Продюсер, Перечисления.кфкСтатусыСообщений.Обработано, 1000);
	Ошибочная = НовоеСообщение(Пакет.Продюсер, Перечисления.кфкСтатусыСообщений.Обработано, 1001);
	НазначитьСообщение(Успешная, Пакет.Поток);
	НазначитьСообщение(Ошибочная, Пакет.Поток);
	Пакет.Компонента.НастроитьОтвет("ОтправитьПакетСРезультатом", ЧастичныйОтвет());

	ОтправитьПакет(Пакет);

	ПроверитьИсходящее(Успешная, Перечисления.кфкСтатусыСообщений.Выгружено, 4);
	ПроверитьИсходящее(Ошибочная, Перечисления.кфкСтатусыСообщений.ОшибкаВыгрузки, 4);
	ПроверитьХэш(Успешная, Истина);
	ПроверитьХэш(Ошибочная, Ложь);

КонецПроцедуры

// Проверяет подавление успешного дубля только при включенной дедупликации.
// Параметры:
//  ИспользоватьХэши - Булево
Процедура Отправка_ПодавляетУспешныйДубль(ИспользоватьХэши) Экспорт

	Пакет = НовыйПакет();
	Запись = НовоеСообщение(Пакет.Продюсер, Перечисления.кфкСтатусыСообщений.Обработано, 1000);
	НазначитьСообщение(Запись, Пакет.Поток);
	Пакет.Компонента.НастроитьОтвет("ОтправитьПакетСРезультатом", УспешныйОтвет());
	ОтправитьПакет(Пакет);
	НазначитьСообщение(Запись, Пакет.Поток);

	ОтправитьПакет(Пакет, "unit-topic", ИспользоватьХэши);

	Статус = ?(ИспользоватьХэши, Перечисления.кфкСтатусыСообщений.ВыгрузкаОтменена,
		Перечисления.кфкСтатусыСообщений.Выгружено);
	ПроверитьИсходящее(Запись, Статус, 5);
	Вызовы = ВызовыОтправки(Пакет);
	Если ИспользоватьХэши Тогда

		ЮТест.ОжидаетЧто(Вызовы, "Дубль не вызывает повторную отправку в транспорт").ИмеетДлину(1);

	Иначе

		ЮТест.ОжидаетЧто(Вызовы, "Без дедупликации сообщение отправляется повторно").ИмеетДлину(2);
		Сообщения = ОбщегоНазначения.JSONВЗначение(Вызовы[1].Параметры[0], , Ложь);
		ЮТест.ОжидаетЧто(Сообщения).ИмеетДлину(1);

	КонецЕсли;

КонецПроцедуры

// Проверяет сохранность очереди после исключения транспортной границы.
Процедура Отправка_ИсключениеНеПодтверждаетСообщение() Экспорт

	Пакет = НовыйПакет();
	Запись = НовоеСообщение(Пакет.Продюсер, Перечисления.кфкСтатусыСообщений.Обработано, 1000);
	НазначитьСообщение(Запись, Пакет.Поток);
	Пакет.Компонента.НастроитьОтвет("ОтправитьПакетСРезультатом",
		"{""total"":""2"",""success_count"":""1"",""failed_count"":""0"",""results"":[]}");

	ЮТест.ОжидаетЧто(ОМ_кфкФоновыеОперацииСлужебный_Отправка)
		.Метод("ют_ВыполнитьОтправку", ЮТМетоды.МассивПараметров(Пакет))
		.ВыбрасываетИсключение("Некорректный результат отправки сообщений");

	ПроверитьИсходящее(Запись, Перечисления.кфкСтатусыСообщений.Обработано, 3);
	ПроверитьНазначение(Запись, Пакет.Поток, Истина);
	ПроверитьХэш(Запись, Ложь);
	ЮТест.ОжидаетЧто(ВызовыОтправки(Пакет)).ИмеетДлину(1);

КонецПроцедуры

// Проверяет прерывание на сохранении после успешного внешнего ответа.
Процедура Отправка_ОшибкаСохраненияНеПодтверждаетЗавершение() Экспорт

	Пакет = НовыйПакет();
	Запись = НовоеСообщение(Пакет.Продюсер, Перечисления.кфкСтатусыСообщений.Обработано, 1000);
	ЮТест.КонтекстТеста().Вставить("ют_КлючОчисткиПослеСбоя", Запись.КлючЗаписи);
	НазначитьСообщение(Запись, Пакет.Поток);
	Пакет.Компонента.НастроитьОтвет("ОтправитьПакетСРезультатом", УспешныйОтвет());
	ЮТест.КонтекстТеста().Вставить("ют_ОшибкаЗаписиИсходящих", Запись.КлючЗаписи);

	ЮТест.ОжидаетЧто(ОМ_кфкФоновыеОперацииСлужебный_Отправка)
		.Метод("ют_ВыполнитьОтправку", ЮТМетоды.МассивПараметров(Пакет))
		.ВыбрасываетИсключение("unit: ошибка сохранения исходящего");

	ЮТест.КонтекстТеста().Удалить("ют_ОшибкаЗаписиИсходящих");
	ПроверитьИсходящее(Запись, Перечисления.кфкСтатусыСообщений.Обработано, 3);
	ПроверитьНазначение(Запись, Пакет.Поток, Истина);
	ПроверитьХэш(Запись, Ложь);
	ЮТест.ОжидаетЧто(ВызовыОтправки(Пакет)).ИмеетДлину(1);

	ОтправитьПакет(Пакет);

	ПроверитьИсходящее(Запись, Перечисления.кфкСтатусыСообщений.Выгружено, 4);
	ПроверитьНазначение(Запись, Пакет.Поток, Ложь);

КонецПроцедуры

#КонецОбласти

#Область КонтрактKafka

// Проверяет независимый эталон адресации и полезной нагрузки на внешней границе.
// Параметры:
//  КлючСообщения - Строка
//  ОжидаемыйКлюч - Строка
Процедура ПакетKafka_СохраняетАдресациюИТело(КлючСообщения, ОжидаемыйКлюч) Экспорт

	Пакет = НовыйПакет();
	Запись = НовоеСообщение(Пакет.Продюсер, Перечисления.кфкСтатусыСообщений.Обработано, 1000);
	Запись.КлючСообщения = КлючСообщения;
	Запись.ТелоСообщения = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище("данные: кириллица, ""кавычки""");
	Запись.Заголовки = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(Новый Структура("Источник", "эталон"));
	Запись.Записать();
	НазначитьСообщение(Запись, Пакет.Поток);
	Пакет.Компонента.НастроитьОтвет("ОтправитьПакетСРезультатом", УспешныйОтвет());

	ОтправитьПакет(Пакет);

	Вызовы = ВызовыОтправки(Пакет);
	ЮТест.ОжидаетЧто(Вызовы).ИмеетДлину(1);
	Аргументы = Вызовы[0].Параметры; // Массив Из Произвольный
	Сообщения = ОбщегоНазначения.JSONВЗначение(Аргументы[0], , Ложь); // Массив Из Структура
	ЮТест.ОжидаетЧто(Аргументы[1]).Равно("unit-topic");
	ЮТест.ОжидаетЧто(Аргументы[2]).Равно(30000);
	ЮТест.ОжидаетЧто(Сообщения).ИмеетДлину(1);
	ЮТест.ОжидаетЧто(Сообщения[0].key).Равно(ОжидаемыйКлюч);
	ЮТест.ОжидаетЧто(Сообщения[0].partition).Равно(-1);
	ЮТест.ОжидаетЧто(Сообщения[0].message).Равно("данные: кириллица, ""кавычки""");
	ЮТест.ОжидаетЧто(Сообщения[0].headers).Равно("Источник,эталон");
	ПроверитьИсходящее(Запись, Перечисления.кфкСтатусыСообщений.Выгружено, 4);
	ПроверитьНазначение(Запись, Пакет.Поток, Ложь);

КонецПроцедуры

// Проверяет отклонение сообщения до вызова транспорта при незаданном топике.
Процедура ПакетKafka_ОтклоняетОтсутствующийТопик() Экспорт

	Пакет = НовыйПакет();
	Запись = НовоеСообщение(Пакет.Продюсер, Перечисления.кфкСтатусыСообщений.Обработано, 1000);
	НазначитьСообщение(Запись, Пакет.Поток);

	ОтправитьПакет(Пакет, "");

	ПроверитьИсходящее(Запись, Перечисления.кфкСтатусыСообщений.ОшибкаВыгрузки, 4);
	ПроверитьХэш(Запись, Ложь);
	ЮТест.ОжидаетЧто(ВызовыОтправки(Пакет), "При отсутствии топика транспорт не вызывается").ИмеетДлину(0);
	Запись.Прочитать();
	ЮТест.ОжидаетЧто(СтрНайти(Запись.ТекстЖурнала, "Отсутствует имя топика") > 0).Равно(Истина);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиТестов

// Возвращает настроенный результат через разрешенную прикладную границу.
// Параметры:
//  Данные - см. ДанныеСериализации
//  СвойстваСообщений - Структура - свойства исходного сообщения.
//  ТекстЖурнала - Строка - выходной журнал.
//  Отказ - Булево - выходной флаг.
// Возвращаемое значение:
//  см. кфкИнтеграция.ПараметрыСообщения
Функция ют_Сериализовать(Данные, СвойстваСообщений, ТекстЖурнала, Отказ) Экспорт

	ЮТест.ОжидаетЧто(СвойстваСообщений.ТипОбъект).Равно("Справочник.кфкПродюсеры");
	ТекстЖурнала = "результат " + Данные.Ключ;
	Отказ = Данные.Исход = "Отказ";
	Если Данные.Исход = "Исключение" Тогда
		ВызватьИсключение "unit: ошибка сериализации";
	КонецЕсли;
	Тело = ?(Данные.Исход = "НетТела", Неопределено, Данные.Тело);
	Сообщение = кфкИнтеграция.ПараметрыСообщения(Тело);
	Сообщение.Ключ = Данные.Ключ;
	Сообщение.Заголовки.Вставить("Источник", Данные.Ключ);

	Возврат Сообщение;

КонецФункции

// Вызывает операцию через публичное утверждение исключений.
// Параметры:
//  Пакет - см. НовыйПакет
Процедура ют_ВыполнитьОтправку(Пакет) Экспорт

	ОтправитьПакет(Пакет);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает собственного владельца сообщений.
// Возвращаемое значение:
//  СправочникСсылка.кфкПродюсеры
Функция НовыйПродюсер()

	Результат = ЮТест.Данные().КонструкторОбъекта(Справочники.кфкПродюсеры)
		.Установить("Наименование", "unit: отправка")
		.Установить("Брокер", кфк_т_ТестовыеДанные.СсылкаБрокераПоУмолчанию())
		.Записать(Ложь, Истина); // СправочникСсылка.кфкПродюсеры

	Возврат Справочники.кфкПродюсеры.ПолучитьСсылку(Результат.УникальныйИдентификатор());

КонецФункции

// Создает собственную строку без выполнения проверяемой операции.
// Параметры:
//  Продюсер - СправочникСсылка.кфкПродюсеры
//  Статус - ПеречислениеСсылка.кфкСтатусыСообщений
//  Метка - Число - миллисекунды регистрации и изменения.
//  Ключ - Строка
// Возвращаемое значение:
//  РегистрСведенийМенеджерЗаписи.кфкИсходящиеСообщения
Функция НовоеСообщение(Продюсер, Статус, Метка, Ключ = "")

	Запись = РегистрыСведений.кфкИсходящиеСообщения.СоздатьМенеджерЗаписи();
	Запись.КлючЗаписи = ?(ПустаяСтрока(Ключ), Строка(Новый УникальныйИдентификатор), Ключ);
	Запись.ДатаРегистрацииМС = Метка;
	Запись.МеткаИзмененияМС = Метка;
	Запись.Продюсер = Продюсер;
	Запись.Статус = Статус;
	Запись.ТипОбъект = "Справочник.кфкПродюсеры";
	Запись.ТипИсходныхДанных = "CatalogRef.кфкПродюсеры";
	Запись.КлючОбъекта = "объект";
	Запись.ТелоСообщения = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище("payload");
	Запись.Заголовки = кфкОбщегоНазначенияСлужебный.ЗначениеВХранилище(Новый Соответствие);
	Запись.ДатаРегистрации = Дата(2026, 1, 1);
	Запись.ТекстЖурнала = "исходный журнал";
	Запись.КоличествоОбработок = 2;
	Запись.КоличествоВыгрузок = 3;
	Запись.Записать();

	Возврат Запись;

КонецФункции

// Параметры:
//  Запись - РегистрСведенийМенеджерЗаписи.кфкИсходящиеСообщения
//  Поток - УникальныйИдентификатор
//  Метка - Число, Неопределено
Процедура НазначитьСообщение(Запись, Поток, Метка = Неопределено)

	Назначение = РегистрыСведений.кфкОчередьПотоков.СоздатьМенеджерЗаписи();
	Назначение.Ключ = Запись.КлючЗаписи;
	Назначение.ВременнаяМетка = ?(Метка = Неопределено, Запись.ДатаРегистрацииМС, Метка);
	Назначение.ИдентификаторПотока = Поток;
	Назначение.Записать();

КонецПроцедуры

// Параметры:
//  Выборка - ВыборкаИзРезультатаЗапроса
// Возвращаемое значение:
//  Массив Из Строка
Функция КлючиВыборки(Выборка)

	Результат = Новый Массив; // Массив Из Строка
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.КлючЗаписи);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Параметры:
//  Запись - РегистрСведенийМенеджерЗаписи.кфкИсходящиеСообщения
//  Статус - ПеречислениеСсылка.кфкСтатусыСообщений
//  Попыток - Число
Процедура ПроверитьИсходящее(Запись, Статус, Попыток)

	Условие = ЮТест.Предикат()
		.Реквизит("КлючЗаписи").Равно(Запись.КлючЗаписи)
		.Реквизит("ДатаРегистрацииМС").Равно(Запись.ДатаРегистрацииМС)
		.Реквизит("Статус").Равно(Статус)
		.Реквизит("КоличествоВыгрузок").Равно(Попыток);
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкИсходящиеСообщения").СодержитЗаписи(Условие);

КонецПроцедуры

// Параметры:
//  Запись - РегистрСведенийМенеджерЗаписи.кфкИсходящиеСообщения
//  Поток - УникальныйИдентификатор
//  Существует - Булево
Процедура ПроверитьНазначение(Запись, Поток, Существует)

	Условие = ЮТест.Предикат()
		.Реквизит("Ключ").Равно(Запись.КлючЗаписи)
		.Реквизит("ВременнаяМетка").Равно(Запись.ДатаРегистрацииМС)
		.Реквизит("ИдентификаторПотока").Равно(Поток);
	Если Существует Тогда
		ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкОчередьПотоков").СодержитЗаписи(Условие);
	Иначе
		ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкОчередьПотоков").НеСодержитЗаписи(Условие);
	КонецЕсли;

КонецПроцедуры

// Параметры:
//  Запись - РегистрСведенийМенеджерЗаписи.кфкИсходящиеСообщения
//  Существует - Булево
Процедура ПроверитьХэш(Запись, Существует)

	Условие = ЮТест.Предикат().Реквизит("КлючЗаписи").Равно(Запись.КлючЗаписи);
	Если Существует Тогда
		ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкХэшСуммыСообщений").СодержитЗаписи(Условие);
	Иначе
		ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкХэшСуммыСообщений").НеСодержитЗаписи(Условие);
	КонецЕсли;

КонецПроцедуры

// Возвращает состояние одного изолированного пакета.
// Возвращаемое значение:
//  Структура:
//   * Продюсер - СправочникСсылка.кфкПродюсеры
//   * Поток - УникальныйИдентификатор
//   * Сессии - Соответствие Из КлючИЗначение
//   * Компонента - ОбработкаОбъект.ют_КомпонентаKafkaДляТестов
//   * Хэши - РегистрСведенийНаборЗаписей.кфкХэшСуммыСообщений
Функция НовыйПакет()

	Результат = Новый Структура;
	Продюсер = НовыйПродюсер(); // СправочникСсылка.кфкПродюсеры
	Результат.Вставить("Продюсер", Продюсер);
	Результат.Вставить("Поток", Новый УникальныйИдентификатор);
	Результат.Вставить("Сессии", Новый Соответствие);
	Результат.Вставить("Компонента", Обработки.ют_КомпонентаKafkaДляТестов.Создать());
	Результат.Вставить("Хэши", РегистрыСведений.кфкХэшСуммыСообщений.СоздатьНаборЗаписей());
	Результат.Компонента.НастроитьОтвет("ПолучитьСообщениеОбОшибке", "unit: отказ транспорта");
	Контекст = ЮТест.КонтекстТеста();
	Контекст.Вставить("ют_КомпонентаKafka", Результат.Компонента);
	Контекст.Вставить("ют_ВызовыФабрикиKafka", Новый Массив);
	Результат.Сессии.Вставить(Результат.Продюсер, Обработки.кфкИнтеграция.Создать());

	Возврат Результат;

КонецФункции

// Параметры:
//  Пакет - см. НовыйПакет
//  Топик - Строка
//  ИспользоватьХэши - Булево
Процедура ОтправитьПакет(Пакет, Топик = "unit-topic", ИспользоватьХэши = Истина)

	Группы = кфкФоновыеОперацииСлужебный.ют_ВыборкаОтправкиВПотоке(Пакет.Поток, 100);
	ЮТест.ОжидаетЧто(Группы.Следующий()).Равно(Истина);
	Типы = Группы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ЮТест.ОжидаетЧто(Типы.Следующий()).Равно(Истина);
	Выборка = Типы.Выбрать();
	Хэши = ?(ИспользоватьХэши, Пакет.Хэши, Неопределено);
	Очереди = кфкФоновыеОперацииСлужебный.ют_ОчередиИсходящих();

	кфкФоновыеОперацииСлужебный.ют_ОтправитьПакет(
		Выборка, Пакет.Сессии, Очереди, Пакет.Поток, Пакет.Продюсер, Топик, Хэши);

КонецПроцедуры

// Параметры:
//  Пакет - см. НовыйПакет
// Возвращаемое значение:
//  Массив Из Структура - фактические обращения к внешнему компоненту.
Функция ВызовыОтправки(Пакет)

	Результат = Новый Массив; // Массив Из Структура
	Для Каждого Вызов Из Пакет.Компонента.ИсторияВызовов() Цикл
		Если Вызов.Метод = "ОтправитьПакетСРезультатом" Тогда
			Результат.Добавить(Вызов);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает независимый ответ транспорта для одного сообщения.
// Возвращаемое значение:
//  Строка
Функция УспешныйОтвет()

	Возврат "{""total"":""1"",""success_count"":""1"",""failed_count"":""0"",""results"":[]}";

КонецФункции

// Возвращает независимый ответ транспорта для успешного и ошибочного сообщений.
// Возвращаемое значение:
//  Строка
Функция ЧастичныйОтвет()

	Возврат "{""total"":""2"",""success_count"":""1"",""failed_count"":""1"",
	|""results"":[{""index"":""0"",""delivered"":""true"",""error"":""""},
	|{""index"":""1"",""delivered"":""false"",""error"":""unit: ошибка второго""}]}";

КонецФункции

// Возвращает данные управляемого прикладного сериализатора.
// Параметры:
//  Исход - Строка
//  Ключ - Строка
// Возвращаемое значение:
//  Структура:
//   * Исход - Строка
//   * Ключ - Строка
//   * Заголовки - Структура
//   * Тело - Строка
Функция ДанныеСериализации(Исход, Ключ)

	Результат = Новый Структура;
	Результат.Вставить("Исход", Исход);
	Результат.Вставить("Ключ", Ключ);
	Результат.Вставить("Заголовки", Новый Структура("Источник", Ключ));
	Результат.Вставить("Тело", "тело " + Ключ);

	Возврат Результат;

КонецФункции

// Параметры:
//  Продюсер - СправочникСсылка.кфкПродюсеры
//  Исход - Строка
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение
Функция ПравилаСериализации(Продюсер, Исход)

	Результат = Новый Соответствие;
	Если Исход = "НетПравила" Тогда
		Возврат Результат;
	КонецЕсли;
	Правило = Новый Структура;
	Правило.Вставить("Тип", Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик);
	Правило.Вставить("ИмяМетода", "ОМ_кфкФоновыеОперацииСлужебный_Отправка.ют_Сериализовать");
	Если Исход = "НетМетода" Тогда
		Правило.ИмяМетода = "";
	КонецЕсли;
	Результат.Вставить(НРег(XMLСтрока(Продюсер) + "Справочник.кфкПродюсеры"), Правило);

	Возврат Результат;

КонецФункции

#КонецОбласти
